{
    "": [
        "--------------------------------------------------------------------------------------------",
        "حقوق الطبع والنشر (c) شركة Microsoft. جميع الحقوق محفوظة.",
        "مرخص بموجب ترخيص MIT. راجع License.txt في جذر المشروع لمزيد من معلومات الترخيص.",
        "--------------------------------------------------------------------------------------------",
        "لا تقم بتحرير هذا الملف. تم إنشاؤه بواسطة الآلة."
    ],
    "version": "1.0.0",
    "contents": {
        "bundle": {
            "$ref '{0}' in '{1}' can not be resolved.": "$ref '{0}' في '{1}' لا يمكن حله.",
            "<empty>": "<فارغ>",
            "A default value. Used by suggestions.": "قيمة افتراضية. يستخدمها الاقتراحات.",
            "A descriptive title of the schema.": "عنوان وصفي للمخطط.",
            "A long description of the schema. Used in hover menus and suggestions.": "وصف طويل للمخطط. يستخدم في قوائم التمرير التلقائي والاقتراحات.",
            "A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "خريطة من أسماء الخصائص إلى إما مصفوفة من أسماء الخصائص أو مخطط. تعني مصفوفة أسماء الخصائص أن الخاصية المسماة في المفتاح تعتمد على وجود الخصائص في المصفوفة داخل الكائن لكي تكون صالحة. إذا كانت القيمة هي مخطط، فيتم تطبيق المخطط على الكائن فقط إذا كانت الخاصية في المفتاح موجودة في الكائن.",
            "A map of property names to schemas for each property.": "خريطة من أسماء الخصائص إلى المخططات لكل خاصية.",
            "A map of regular expressions on property names to schemas for matching properties.": "خريطة من التعبيرات العادية لأسماء الخصائص إلى المخططات لمطابقة الخصائص.",
            "A number that should cleanly divide the current value (i.e. have no remainder).": "رقم يجب أن يقسم القيمة الحالية بشكل نظيف (أي لا يوجد باقي).",
            "A regular expression to match the string against. It is not implicitly anchored.": "تعبير منتظم لمطابقة السلسلة معه. ليس مؤطرًا ضمنيًا.",
            "A schema which must not match.": "مخطط يجب ألا يتطابق.",
            "A unique identifier for the schema.": "معرف فريد للمخطط.",
            "An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "يعتبر مثال المصفوفة صالحًا مع \"contains\" إذا كان على الأقل أحد عناصره صالحًا مع المخطط المحدد.",
            "An array of schemas, all of which must match.": "مصفوفة من المخططات، يجب أن تتطابق جميعها.",
            "An array of schemas, exactly one of which must match.": "مصفوفة من المخططات، يجب أن يتطابق واحد منها فقط.",
            "An array of schemas, where at least one must match.": "مصفوفة من المخططات، حيث يجب أن يتطابق واحد على الأقل.",
            "An array of strings that lists the names of all properties required on this object.": "مصفوفة من السلاسل التي تسرد أسماء جميع الخصائص المطلوبة على هذا الكائن.",
            "An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "تتم المصادقة على المثال بنجاح مع هذه الكلمة الرئيسية إذا كانت قيمته مساوية لقيمة الكلمة الرئيسية.",
            "Array does not contain required item.": "المصفوفة لا تحتوي على العنصر المطلوب.",
            "Array has duplicate items.": "المصفوفة تحتوي على عناصر مكررة.",
            "Array has too few items that match the contains contraint. Expected {0} or more.": "المصفوفة تحتوي على عدد قليل جدًا من العناصر التي تتوافق مع شرط \"contains\". كان من المتوقع {0} أو أكثر.",
            "Array has too few items. Expected {0} or more.": "المصفوفة تحتوي على عدد قليل جدًا من العناصر. كان من المتوقع {0} أو أكثر.",
            "Array has too many items according to schema. Expected {0} or fewer.": "المصفوفة تحتوي على العديد من العناصر وفقًا للمخطط. كان من المتوقع {0} أو أقل.",
            "Array has too many items that match the contains contraint. Expected {0} or less.": "المصفوفة تحتوي على العديد من العناصر التي تتوافق مع شرط \"contains\". كان من المتوقع {0} أو أقل.",
            "Array has too many items. Expected {0} or fewer.": "المصفوفة تحتوي على العديد من العناصر. كان من المتوقع {0} أو أقل.",
            "Colon expected": "تم توقع نقطتين",
            "Comments are not permitted in JSON.": "لا يُسمح بالتعليقات في JSON.",
            "Comments from schema authors to readers or maintainers of the schema.": "تعليقات من مؤلفي المخططات إلى القراء أو القائمين على الصيانة.",
            "Configure": "تكوين",
            "Configured by extension: {0}": "تم التكوين بواسطة الإضافة: {0}",
            "Configured in user settings": "تم التكوين في إعدادات المستخدم",
            "Configured in workspace settings": "تم التكوين في إعدادات مساحة العمل",
            "Default value": "القيمة الافتراضية",
            "Describes the content encoding of a string property.": "يصف ترميز المحتوى لخاصية سلسلة.",
            "Describes the format expected for the value. By default, not used for validation": "يصف التنسيق المتوقع للقيمة. بشكل افتراضي، لا يتم استخدامه للتحقق",
            "Describes the media type of a string property.": "يصف نوع الوسائط لخاصية سلسلة.",
            "Downloading schemas is disabled through setting '{0}'": "تم تعطيل تحميل المخططات من خلال الإعداد \"{0}\"",
            "Downloading schemas is disabled. Click to configure.": "تم تعطيل تحميل المخططات. انقر للتكوين.",
            "Draft-03 schemas are not supported.": "لا يتم دعم المخططات من نوع Draft-03.",
            "Duplicate anchor declaration: '{0}'": "إعلان مرساة مكرر: '{0}'",
            "Duplicate object key": "مفتاح كائن مكرر",
            "Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "إما مخطط أو قيمة منطقية. إذا كان مخططًا، يتم استخدامه للتحقق من جميع الخصائص التي لا تتطابق مع 'properties' أو 'propertyNames' أو 'patternProperties'. إذا كانت القيمة false، فإن أي خصائص غير معرفة بواسطة الكلمات الرئيسية المجاورة ستؤدي إلى فشل هذا المخطط.",
            "Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "إما سلسلة من أحد الأنواع الأساسية للمخططات (عدد، عدد صحيح، null، مصفوفة، كائن، منطقية، سلسلة) أو مصفوفة من السلاسل تحدد مجموعة فرعية من تلك الأنواع.",
            "End of file expected.": "تم توقع نهاية الملف.",
            "Expected a JSON object, array or literal.": "تم توقع كائن JSON أو مصفوفة أو حرف ثابت.",
            "Expected comma": "تم توقع فاصلة",
            "Expected comma or closing brace": "تم توقع فاصلة أو قوس غلق",
            "Expected comma or closing bracket": "تم توقع فاصلة أو قوس غلق",
            "Failed to sort the JSONC document, please consider opening an issue.": "فشل في ترتيب مستند JSONC، يرجى النظر في فتح مشكلة.",
            "For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "للمصفوفات، فقط عندما يتم تعيين العناصر كمصفوفة. إذا كانت العناصر مخططًا، فإن هذا المخطط يتحقق من العناصر بعد العناصر المحددة في مخطط العناصر. إذا كانت القيمة false، فإن العناصر الإضافية ستؤدي إلى فشل التحقق.",
            "For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "للمصفوفات. يمكن أن يكون إما مخططًا للتحقق من صحة كل عنصر أو مصفوفة من المخططات للتحقق من كل عنصر حسب الترتيب (المخطط الأول سيتحقق من العنصر الأول، والمخطط الثاني سيتحقق من العنصر الثاني، وهكذا).",
            "If all of the items in the array must be unique. Defaults to false.": "إذا كان يجب أن تكون جميع العناصر في المصفوفة فريدة. الافتراضي هو false.",
            "If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "إذا كانت الحالة كائنًا، فإن هذه الكلمة الرئيسية تتحقق من صحة كل اسم خاصية في الحالة مع المخطط المقدم.",
            "Incorrect type. Expected \"{0}\".": "نوع غير صحيح. تم التوقع \"{0}\".",
            "Incorrect type. Expected one of {0}.": "نوع غير صحيح. تم التوقع أحد الأنواع {0}.",
            "Indicates that the value of the instance is managed exclusively by the owning authority.": "يشير إلى أن قيمة الحالة تتم إدارتها حصريًا بواسطة الجهة المالكة.",
            "Invalid characters in string. Control characters must be escaped.": "حروف غير صالحة في السلسلة. يجب أن تكون حروف التحكم مع escape.",
            "Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "تنسيق اللون غير صالح. استخدم #RGB، #RGBA، #RRGGBB أو #RRGGBBAA.",
            "Invalid escape character in string.": "شخصية الهروب غير صالحة في السلسلة.",
            "Invalid number format.": "تنسيق الرقم غير صالح.",
            "Invalid unicode sequence in string.": "تسلسل Unicode غير صالح في السلسلة.",
            "Item does not match any validation rule from the array.": "العنصر لا يتطابق مع أي قاعدة تحقق من المصفوفة.",
            "JSON Language Server": "خادم لغة JSON",
            "JSON Outline Status": "حالة المخطط JSON",
            "JSON Validation Status": "حالة التحقق من JSON",
            "JSON schema cache cleared.": "تم مسح ذاكرة التخزين المؤقت للمخطط JSON.",
            "JSON schema configured": "تم تكوين المخطط JSON",
            "JSON: Schema Resolution Error": "JSON: خطأ في حل المخطط",
            "Learn more about JSON schema configuration...": "تعرف على المزيد حول تكوين المخطط JSON...",
            "Loading JSON info": "جاري تحميل معلومات JSON",
            "Makes the maximum property exclusive.": "يجعل الخاصية القصوى حصرية.",
            "Makes the minimum property exclusive.": "يجعل الخاصية الدنيا حصرية.",
            "Matches a schema that is not allowed.": "يتطابق مع مخطط غير مسموح به.",
            "Matches multiple schemas when only one must validate.": "يتطابق مع عدة مخططات عندما يجب أن يتحقق واحد فقط."
        },
        "package": {
            "description": "يوفر دعمًا قويًا للغة لملفات JSON.",
            "displayName": "ميزات لغة JSON",
            "json.clickToRetry": "انقر لإعادة المحاولة.",
            "json.colorDecorators.enable.deprecationMessage": "القيمة \"json.colorDecorators.enable\" قديمة لصالح \"editor.colorDecorators\".",
            "json.colorDecorators.enable.desc": "تمكين أو تعطيل زينة الألوان",
            "json.command.clearCache": "مسح ذاكرة التخزين المؤقت للمخطط",
            "json.command.sort": "ترتيب الوثيقة",
            "json.enableSchemaDownload.desc": "عند تمكينه، يمكن تحميل مخططات JSON من مواقع http و https.",
            "json.format.enable.desc": "تمكين أو تعطيل المُنسيق الافتراضي ل JSON",
            "json.format.keepLines.desc": "الحفاظ على جميع الأسطر الجديدة الموجودة أثناء التنسيق.",
            "json.maxItemsComputed.desc": "العدد الأقصى للرموز المخططة ومناطق الطي المحسوبة (مقيد من أجل الأداء).",
            "json.maxItemsExceededInformation.desc": "عرض إشعار عند تجاوز الحد الأقصى للرموز المخططة والمناطق القابلة للطي.",
            "json.schemaResolutionErrorMessage": "فشل في حل المخطط.",
            "json.schemas.desc": "يربط المخططات بملفات JSON في المشروع الحالي.",
            "json.schemas.fileMatch.desc": "مصفوفة من الأنماط الخاصة بالملفات للبحث عن المطابقة عند حل الملفات JSON في المخططات، يمكن استخدام \"*\" و \"**\" كرمز عام. يمكن أيضًا تحديد الأنماط المستثناة وتبدأ بـ \"!\". يتطابق الملف عندما يكون هناك نمط واحد على الأقل مطابق وآخر نمط مطابق ليس نمط استبعاد.",
            "json.schemas.fileMatch.item.desc": "نمط ملف قد يحتوي على \"*\" و \"**\" للبحث عن التطابق عند حل الملفات JSON في المخططات. عندما يبدأ بـ \"!\"، فإنه يحدد نمط استبعاد.",
            "json.schemas.schema.desc": "تعريف المخطط من العنوان URL المحدد. يحتاج فقط إلى توفير المخطط لتجنب الوصول إلى عنوان URL للمخطط.",
            "json.schemas.url.desc": "عنوان URL أو مسار ملف مطلق إلى مخطط. يمكن أن يكون مسارًا نسبيًا (يبدأ بـ './') في إعدادات مساحة العمل ومجلد مساحة العمل.",
            "json.tracing.desc": "يتتبع الاتصال بين VS Code وخادم لغة JSON.",
            "json.validate.enable.desc": "تمكين أو تعطيل التحقق من صحة JSON."
        }
    }
}
