{
    "": [
        "--------------------------------------------------------------------------------------------",
        "Copyright (c) Microsoft Corporation. All rights reserved.",
        "Licensed under the MIT License. See License.txt in the project root for license information.",
        "--------------------------------------------------------------------------------------------",
        "Do not edit this file. It is machine generated."
    ],
    "version": "1.0.0",
    "contents": {
        "bundle": {
            "\"store\" a boolean test for later evaluation in a guard or if().": "\"تخزين\" اختبار منطقي لتقييمه لاحقًا في حراسة أو if().",
            "'from' expected": "تم توقع \"from\"",
            "'in' expected": "تم توقع \"in\"",
            "'through' or 'to' expected": "تم توقع 'through' أو 'to'",
            "'{0}'": "'{0}'",
            "( expected": "تم توقع (",
            ") expected": "تم توقع )",
            "<undefined>": "<غير معرف>",
            "@font-face": "@font-face",
            "@font-face rule must define 'src' and 'font-family' properties": "يجب على قاعدة @font-face تحديد خصائص \"src\" و \"font-family\"",
            "@keyframes {0}": "@keyframes {0}",
            "A list of properties that are not validated against the `unknownProperties` rule.": "قائمة الخصائص التي لا يتم التحقق من صحتها باستخدام قاعدة \"unknownProperties\".",
            "Adds quotes to a string.": "يضيف علامات اقتباس إلى سلسلة.",
            "Also define the standard property '{0}' for compatibility": "يتم أيضًا تعريف الخاصية القياسية \"{0}\" من أجل التوافق",
            "Always define standard rule '@keyframes' when defining keyframes.": "دائمًا قم بتعريف القاعدة القياسية \"@keyframes\" عند تعريف الإطارات الرئيسية.",
            "Always include all vendor specific properties: Missing: {0}": "دائمًا قم بتضمين جميع الخصائص الخاصة بالمورد: مفقود: {0}",
            "Always include all vendor specific rules: Missing: {0}": "دائمًا قم بتضمين جميع القواعد الخاصة بالمورد: مفقود: {0}",
            "Appends a single value onto the end of a list.": "يضيف قيمة واحدة إلى نهاية قائمة.",
            "Appends selectors to one another without spaces in between.": "يضيف المحددات إلى بعضها البعض دون وجود مسافات بينهما.",
            "Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "تجنب استخدام !important. فهو يشير إلى أن تخصيص CSS بالكامل قد خرج عن السيطرة ويحتاج إلى إعادة هيكلة.",
            "Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "تجنب استخدام 'float'. القيم float تؤدي إلى CSS هشة قد تتلف بسهولة إذا تغير أي جانب من جوانب التخطيط.",
            "Causes one or more rules to be emitted at the root of the document.": "يتسبب في إصدار قاعدة أو أكثر في جذر المستند.",
            "Changes one or more properties of a color.": "يغير واحدة أو أكثر من خصائص اللون.",
            "Changes the alpha component for a color.": "يغير مكون ألفا للون.",
            "Changes the hue of a color.": "يغير درجة اللون للون.",
            "Character entity representing '{0}'": "كيان حرف يمثل \"{0}\"",
            "Character entity representing '{0}', unicode equivalent '{1}'": "كيان حرف يمثل \"{0}\" (معادل يونيكود: \"{1}\")",
            "Closing bracket expected.": "تم توقع قوس الإغلاق.",
            "Closing bracket missing.": "قوس الإغلاق مفقود.",
            "Combines several lists into a single multidimensional list.": "يجمع عدة قوائم في قائمة متعددة الأبعاد واحدة.",
            "Configure": "تكوين",
            "Converts a color into the format understood by IE filters.": "يحول اللون إلى التنسيق الذي تفهمه مرشحات IE.",
            "Converts a color to grayscale.": "يحول اللون إلى تدرج رمادي.",
            "Converts a string to lower case.": "يحول السلسلة إلى حروف صغيرة.",
            "Converts a string to upper case.": "يحول السلسلة إلى حروف كبيرة.",
            "Converts a unitless number to a percentage.": "يحول رقمًا بدون وحدة إلى نسبة مئوية.",
            "Creates a Color from hue, saturation, and lightness values.": "ينشئ لونًا من قيم درجة اللون والتشبع والسطوع.",
            "Creates a Color from hue, saturation, lightness, and alpha values.": "ينشئ لونًا من قيم درجة اللون والتشبع والسطوع والألفا.",
            "Creates a Color from hue, white, and black values.": "ينشئ لونًا من قيم درجة اللون والأبيض والأسود.",
            "Creates a Color from lightness, a, and b values.": "ينشئ لونًا من قيم السطوع وa وb.",
            "Creates a Color from lightness, chroma, and hue values.": "ينشئ لونًا من قيم السطوع والكروما ودرجة اللون.",
            "Creates a Color from red, green, and blue values.": "ينشئ لونًا من قيم الأحمر والأخضر والأزرق.",
            "Creates a Color from red, green, blue, and alpha values.": "ينشئ لونًا من قيم الأحمر والأخضر والأزرق والألفا.",
            "Creates a Color from the hue, saturation, and lightness values of another Color.": "ينشئ لونًا من قيم درجة اللون والتشبع والسطوع للون آخر.",
            "Creates a Color from the hue, white, and black values of another Color.": "ينشئ لونًا من قيم درجة اللون والأبيض والأسود للون آخر.",
            "Creates a Color from the lightness, a, and b values of another Color.": "ينشئ لونًا من قيم السطوع وa وb للون آخر.",
            "Creates a Color from the lightness, chroma, and hue values of another Color.": "ينشئ لونًا من قيم السطوع والكروما ودرجة اللون للون آخر.",
            "Creates a Color from the red, green, and blue values of another Color.": "ينشئ لونًا من قيم الأحمر والأخضر والأزرق للون آخر.",
            "Creates a Color in a specific color space from red, green, and blue values.": "ينشئ لونًا في مساحة لونية محددة من قيم الأحمر والأخضر والأزرق.",
            "Creates a Color in a specific color space from the red, green, and blue values of another Color.": "ينشئ لونًا في مساحة لونية محددة من قيم الأحمر والأخضر والأزرق للون آخر.",
            "Defines complex operations that can be re-used throughout stylesheets.": "يحدد العمليات المعقدة التي يمكن إعادة استخدامها عبر أوراق الأنماط.",
            "Defines styles that can be re-used throughout the stylesheet with `@include`.": "يحدد الأنماط التي يمكن إعادة استخدامها عبر ورقة الأنماط باستخدام `@include`.",
            "Do not use duplicate style definitions": "لا تستخدم تعريفات الأنماط المكررة",
            "Do not use empty rulesets": "لا تستخدم مجموعات القواعد الفارغة.",
            "Do not use width or height when using padding or border": "لا تستخدم العرض أو الارتفاع عند استخدام الحشو أو الحدود.",
            "Dynamically calls a Sass function.": "يستدعي وظيفة SASS بشكل ديناميكي.",
            "Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "كل حلقة تقوم بتعيين \"$var\" إلى كل عنصر في القائمة أو الخريطة، ثم تعرض الأنماط التي تحتوي عليها باستخدام تلك القيمة لـ \"$var\".",
            "End tag name expected.": "تم توقع اسم علامة الإغلاق.",
            "Exposes the details of Sass’s inner workings.": "يكشف عن تفاصيل عمل SASS الداخلي.",
            "Extends $extendee with $extender within $selector.": "يمدد $extendee بـ $extender ضمن $selector.",
            "Extracts a substring from $string.": "يستخرج جزءًا فرعيًا من $string.",
            "Finds the maximum of several numbers.": "يجد الحد الأقصى لعدة أرقام.",
            "Finds the minimum of several numbers.": "يجد الحد الأدنى لعدة أرقام.",
            "Fluidly scales one or more properties of a color.": "يتم تحجيم خصائص اللون بسلاسة.",
            "Folding Region End": "نهاية المنطقة القابلة للطي",
            "Folding Region Start": "بداية المنطقة القابلة للطي",
            "For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "حلقة For التي تعرض مجموعة من الأنماط لكل \"$var\" في جملة `from/through` أو `from/to`.",
            "Generates new colors based on existing ones, making it easy to build color themes.": "ينشئ ألوانًا جديدة بناءً على الألوان الحالية، مما يسهل بناء ثيمات الألوان.",
            "Gets the blue component of a color.": "يُحصل على المكون الأزرق للون.",
            "Gets the green component of a color.": "يُحصل على المكون الأخضر للون.",
            "Gets the hue component of a color.": "يُحصل على مكون اللون من اللون.",
            "Gets the lightness component of a color.": "يُحصل على مكون الإضاءة للون.",
            "Gets the opacity component of a color.": "يُحصل على مكون الشفافية للون.",
            "Gets the red component of a color.": "يُحصل على المكون الأحمر للون.",
            "Gets the saturation component of a color.": "يُحصل على مكون التشبع للون.",
            "HTML Language Server": "خادم لغة HTML",
            "Hex colors must consist of three, four, six or eight hex numbers": "يجب أن تتكون الألوان السداسية من ثلاثة أو أربعة أو ستة أو ثمانية أرقام سداسية عشرية",
            "IE hacks are only necessary when supporting IE7 and older": "الحيل في IE ضرورية فقط عند دعم IE7 والإصدارات القديمة",
            "Import statements do not load in parallel": "تعليمات الاستيراد لا تُحمّل بالتوازي",
            "Includes the body if the expression does not evaluate to `false` or `null`.": "يشمل الجسم إذا لم تُقيّم التعبير كـ`false` أو `null`.",
            "Includes the styles defined by another mixin into the current rule.": "يشمل الأنماط المعرفة من خلال مزيج آخر في القاعدة الحالية.",
            "Increases or decreases one or more components of a color.": "يزيد أو يقلل مكون أو أكثر من مكونات اللون.",
            "Inherits the styles of another selector.": "يرث الأنماط من مُحدد آخر.",
            "Inserts $insert into $string at $index.": "يُدرج $insert في $string عند $index.",
            "Invalid number of parameters": "عدد المعلمات غير صالح",
            "Joins together two lists into one.": "يجمع قائمتين في قائمة واحدة.",
            "Lets you access and modify values in lists.": "يسمح لك بالوصول إلى القيم في القوائم وتعديلها.",
            "Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "يُحمّل ورقة أنماط Sass ويجعل المزيجات والدوال والمتغيرات الخاصة بها متاحة عند تحميل ورقة الأنماط هذه باستخدام قاعدة @use.",
            "Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "يُحمّل المزيجات والدوال والمتغيرات من أوراق أنماط Sass الأخرى كـ 'وحدات'، ودمج CSS من عدة أوراق أنماط معًا.",
            "Makes a color darker.": "يجعل اللون أغمق.",
            "Makes a color less saturated.": "يجعل اللون أقل تشبعًا.",
            "Makes a color lighter.": "يجعل اللون أفتح.",
            "Makes a color more opaque.": "يجعل اللون أكثر تعتيمًا.",
            "Makes a color more saturated.": "يجعل اللون أكثر تشبعًا.",
            "Makes a color more transparent.": "يجعل اللون أكثر شفافية.",
            "Makes it easy to combine, search, or split apart strings.": "يجعل من السهل دمج السلاسل النصية أو البحث عنها أو تقسيمها.",
            "Makes it possible to look up the value associated with a key in a map, and much more.": "يجعل من الممكن البحث عن القيمة المرتبطة بمفتاح في خريطة، وأكثر من ذلك.",
            "Merges two maps together into a new map.": "يمزج خريطتين معًا في خريطة جديدة.",
            "Mix two colors together in a polar color space.": "يمزج لونين معًا في مساحة لونية قطبية.",
            "Mix two colors together in a rectangular color space.": "يمزج لونين معًا في مساحة لونية مستطيلة.",
            "Mixes two colors together.": "يمزج لونين معًا.",
            "Nests selector beneath one another like they would be nested in the stylesheet.": "يُعشش المحددات تحت بعضها كما لو كانت مُعشّشة في ورقة الأنماط.",
            "No unit for zero needed": "لا حاجة لوحدة للصفر",
            "Parses a selector into the format returned by &.": "يحلل المحدد إلى التنسيق الذي يعيده &.",
            "Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "يطبع قيمة التعبير إلى تدفق الإخراج القياسي للأخطاء. مفيد لتصحيح أخطاء ملفات Sass المعقدة.",
            "Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "يطبع قيمة التعبير إلى تدفق الإخراج القياسي للأخطاء. مفيد للمكتبات التي تحتاج إلى تحذير المستخدمين من الانتهاء أو التصحيح من الأخطاء البسيطة في استخدام المزيجات. يمكن إيقاف التحذيرات باستخدام خيار سطر الأوامر `--quiet` أو خيار Sass `:quiet`.",
            "Property is ignored due to the display.": "يتم تجاهل الخاصية بسبب العرض.",
            "Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "يتم تجاهل الخاصية بسبب العرض. مع 'display: block'، لا ينبغي استخدام المحاذاة الرأسية.",
            "Provides access to Sass’s powerful selector engine.": "يوفر الوصول إلى محرك المحدد القوي في Sass.",
            "Provides functions that operate on numbers.": "يوفر دوالًا تعمل على الأرقام.",
            "Removes quotes from a string.": "يزيل علامات الاقتباس من سلسلة نصية.",
            "Rename to '{0}'": "إعادة التسمية إلى '{0}'",
            "Replaces $original with $replacement within $selector.": "يستبدل $original بـ $replacement ضمن $selector.",
            "Replaces the nth item in a list.": "يستبدل العنصر nth في القائمة.",
            "Returns a list of all keys in a map.": "يرجع قائمة بجميع المفاتيح في الخريطة.",
            "Returns a list of all values in a map.": "يرجع قائمة بجميع القيم في الخريطة.",
            "Returns a new map with keys removed.": "يرجع خريطة جديدة مع المفاتيح التي تم إزالتها.",
            "Returns a random number.": "يرجع رقمًا عشوائيًا.",
            "Returns a specific item in a list.": "يرجع عنصرًا معينًا في القائمة.",
            "Returns the absolute value of a number.": "يرجع القيمة المطلقة للعدد.",
            "Returns the complement of a color.": "يرجع مكمل اللون.",
            "Returns the index of the first occurance of $substring in $string.": "يرجع فهرس أول حدوث لـ $substring في $string.",
            "Returns the inverse of a color.": "يرجع العكس للون.",
            "Returns the keywords passed to a function that takes variable arguments.": "يرجع الكلمات الرئيسية التي تم تمريرها إلى دالة تقبل معلمات متغيرة.",
            "Returns the length of a list.": "يرجع طول القائمة.",
            "Returns the number of characters in a string.": "يرجع عدد الأحرف في السلسلة النصية.",
            "Returns the position of a value within a list.": "يرجع موقع قيمة ضمن قائمة.",
            "Returns the separator of a list.": "يرجع فاصل القائمة.",
            "Returns the simple selectors that comprise a compound selector.": "يرجع المحددات البسيطة التي تتألف منها المحددات المركبة.",
            "Returns the string representation of a value as it would be represented in Sass.": "يرجع التمثيل النصي للقيمة كما سيتم تمثيلها في Sass.",
            "Returns the type of a value.": "يرجع نوع القيمة.",
            "Returns the unit(s) associated with a number.": "يرجع الوحدة أو الوحدات المرتبطة برقم.",
            "Returns the value in a map associated with a given key.": "يرجع القيمة في الخريطة المرتبطة بمفتاح معين.",
            "Returns whether $super matches all the elements $sub does, and possibly more.": "يرجع ما إذا كان $super يطابق جميع العناصر التي يطابقها $sub، وربما أكثر.",
            "Returns whether a feature exists in the current Sass runtime.": "يرجع ما إذا كانت ميزة موجودة في بيئة تشغيل Sass الحالية.",
            "Returns whether a function with the given name exists.": "يرجع ما إذا كانت دالة بالاسم المعطى موجودة.",
            "Returns whether a map has a value associated with a given key.": "يرجع ما إذا كانت الخريطة تحتوي على قيمة مرتبطة بمفتاح معين.",
            "Returns whether a mixin with the given name exists.": "يرجع ما إذا كان هناك مزيج بالاسم المعطى.",
            "Returns whether a number has units.": "يرجع ما إذا كان للعدد وحدات.",
            "Returns whether a variable with the given name exists in the current scope.": "يرجع ما إذا كانت هناك متغيرات بالاسم المعطى في النطاق الحالي.",
            "Returns whether a variable with the given name exists in the global scope.": "يرجع ما إذا كانت هناك متغيرات بالاسم المعطى في النطاق العالمي.",
            "Returns whether two numbers can be added, subtracted, or compared.": "يرجع ما إذا كان يمكن إضافة أو طرح أو مقارنة رقمين.",
            "Rounds a number down to the previous whole number.": "يقوم بتقريب الرقم لأسفل إلى الرقم الصحيح السابق.",
            "Rounds a number to the nearest whole number.": "يقوم بتقريب الرقم إلى أقرب عدد صحيح.",
            "Rounds a number up to the next whole number.": "يقوم بتقريب الرقم لأعلى إلى الرقم الصحيح التالي.",
            "Sass documentation": "توثيق Sass",
            "Selector Specificity": "خصوصية المحدد",
            "Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "لا يجب أن تحتوي المحددات على معرّفات لأن هذه القواعد مرتبطة بشكل وثيق بـ HTML.",
            "Simple HTML5 starting point": "نقطة البداية البسيطة لـ HTML5",
            "Start tag name expected.": "اسم وسم البداية متوقع.",
            "Tag name must directly follow the open bracket.": "يجب أن يتبع اسم الوسم مباشرة القوس المفتوح.",
            "The universal selector (*) is known to be slow": "المحدد العام (*) معروف بأنه بطيء.",
            "Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "يطلق قيمة التعبير كخطأ قاتل مع تتبع المكدس. مفيد للتحقق من صحة المعاملات المرسلة إلى المزيجات والدوال.",
            "URI expected": "تم توقع URI",
            "URL encodes a string": "تشفير URL لسلسلة نصية",
            "Unexpected character in tag.": "حرف غير متوقع في الوسم.",
            "Unifies two selectors to produce a selector that matches elements matched by both.": "يوحد محددين لإنشاء محدد يتطابق مع العناصر التي يتطابق معها كلاهما.",
            "Unknown at-rule.": "قاعدة at-rule غير معروفة.",
            "Unknown property.": "خاصية غير معروفة.",
            "Unknown property: '{0}'": "خاصية غير معروفة: \"{0}\"",
            "Unknown vendor specific property.": "خاصية خاصة بالبائع غير معروفة.",
            "VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "الآن يحتوي VS Code على دعم مدمج لإعادة تسمية العلامات تلقائيًا. هل ترغب في تمكينها؟",
            "When using a vendor-specific prefix also include the standard property": "عند استخدام بادئة مخصصة للبائع، يشمل أيضًا الخاصية القياسية.",
            "When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "عند استخدام بادئة مخصصة للبائع، تأكد من تضمين جميع الخصائص المخصصة للبائع الأخرى أيضًا",
            "While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "حلقة While التي تأخذ تعبيرًا وتطبع الأنماط المتداخلة مرارًا وتكرارًا حتى يتم تقييم البيان إلى `false`.",
            "[ expected": "تم توقع [",
            "] expected": "تم توقع ]",
            "absolute value of a number": "القيمة المطلقة للعدد",
            "arccosine - inverse of cosine function": "القطب الزاوي - معكوس دالة الجيب التمام",
            "arcsine - inverse of sine function": "القوس الجيب - معكوس دالة الجيب",
            "arctangent - inverse of tangent function": "التانجين - معكوس دالة المماس",
            "argument from '{0}'": "الحجة من \"{0}\"",
            "at-rule or selector expected": "تم توقع قاعدة at-rule أو محدد",
            "at-rule unknown": "قاعدة at-rule غير معروفة",
            "bind the evaluation of a ruleset to each member of a list.": "ربط تقييم مجموعة القواعد بكل عضو في القائمة.",
            "calculates square root of a number": "يحسب الجذر التربيعي للعدد",
            "colon expected": "تم توقع نقطتين",
            "comma expected": "تم توقع فاصلة",
            "condition expected": "تم توقع شرط",
            "converts numbers from one type into another": "يحول الأرقام من نوع إلى آخر",
            "converts to a %, e.g. 0.5 > 50%": "يحول إلى نسبة مئوية، على سبيل المثال 0.5 > 50%",
            "cosine function": "دالة الجيب التمام",
            "creates a #AARRGGBB": "ينشئ #AARRGGBB",
            "creates a color": "ينشئ لونًا",
            "dot expected": "تم توقع نقطة",
            "escape string content": "محتوى السلسلة النصية المحمي",
            "expression expected": "تم توقع تعبير.",
            "first argument modulus second argument": "القيمة الأولى معاملات القيمة الثانية",
            "first argument raised to the power of the second argument": "العدد الأول مرفوع للقوة الثانية",
            "generate a list spanning a range of values": "توليد قائمة تغطي نطاقًا من القيم",
            "identifier expected": "تم توقع معرف",
            "identifier or variable expected": "تم توقع معرف أو متغير",
            "identifier or wildcard expected": "تم توقع معرف أو حرف عام",
            "inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "تم تجاهل inline-block بسبب الفلوتر. إذا كان 'float' له قيمة غير 'none'، يتم تعويم الصندوق ويتم التعامل مع 'display' على أنه 'block'",
            "inlines a resource and falls back to `url()`": "يتم تضمين مورد ويعود إلى `url()`",
            "media query expected": "تم توقع استعلام وسائط",
            "number expected": "تم توقع عدد",
            "operator expected": "تم توقع عامل",
            "page directive or declaraton expected": "تم توقع توجيه صفحة أو إعلان",
            "parses a string to a color": "يحلل سلسلة إلى لون",
            "percentage expected": "تم توقع نسبة مئوية",
            "property value expected": "تم توقع قيمة خاصية",
            "remove or change the unit of a dimension": "إزالة أو تغيير وحدة البُعد",
            "return `@color` 10% points darker": "إرجاع `@color` مع 10% نقاط أغمق",
            "return `@color` 10% points less saturated": "إرجاع `@color` مع 10% نقاط أقل تشبعًا",
            "return `@color` 10% points less transparent": "إرجاع `@color` مع 10% نقاط أقل شفافية",
            "return `@color` 10% points lighter": "إرجاع `@color` مع 10% نقاط أكثر إضاءة",
            "return `@color` 10% points more saturated": "إرجاع `@color` مع 10% نقاط أكثر تشبعًا",
            "return `@color` 10% points more transparent": "إرجاع `@color` مع 10% نقاط أكثر شفافية",
            "return `@color` with 50% transparency": "إرجاع `@color` مع 50% شفافية",
            "return `@color` with a 10 degree larger in hue": "إرجاع `@color` مع زيادة في التدرج اللوني بمقدار 10 درجات",
            "return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "إرجاع `@darkcolor` إذا كان `@color1 > 43% luma` وإلا إرجاع `@lightcolor`، راجع الملاحظات.",
            "return a mix of `@color1` and `@color2`": "إرجاع مزيج من `@color1` و `@color2`",
            "returns a grey, 100% desaturated color": "إرجاع لون رمادي 100% غير مشبع",
            "returns a value at the specified position in the list": "إرجاع قيمة في الموضع المحدد في القائمة",
            "returns one of two values depending on a condition.": "إرجاع أحد القيمتين بناءً على شرط.",
            "returns pi": "إرجاع باي",
            "returns the `alpha` channel of `@color`": "إرجاع قناة `alpha` من `@color`",
            "returns the `blue` channel of `@color`": "إرجاع قناة `blue` من `@color`",
            "returns the `green` channel of `@color`": "إرجاع قناة `green` من `@color`",
            "returns the `hue` channel of `@color` in the HSL space": "إرجاع قناة `hue` من `@color` في مساحة HSL",
            "returns the `hue` channel of `@color` in the HSV space": "إرجاع قناة `hue` من `@color` في مساحة HSV",
            "returns the `lightness` channel of `@color` in the HSL space": "إرجاع قناة `lightness` من `@color` في مساحة HSL",
            "returns the `luma` value (perceptual brightness) of `@color`": "إرجاع قيمة `luma` (السطوع المدرك) من `@color`",
            "returns the `red` channel of `@color`": "إرجاع قناة `red` من `@color`",
            "returns the `saturation` channel of `@color` in the HSL space": "إرجاع قناة `saturation` من `@color` في مساحة HSL",
            "returns the `saturation` channel of `@color` in the HSV space": "إرجاع قناة `saturation` من `@color` في مساحة HSV",
            "returns the `value` channel of `@color` in the HSV space": "إرجاع قناة `value` من `@color` في مساحة HSV",
            "returns the lowest of one or more values": "إرجاع أدنى قيمة من قيمة أو أكثر",
            "returns the number of elements in a value list": "إرجاع عدد العناصر في قائمة القيم",
            "rounds a number to a number of places": "تقريب عدد إلى عدد من المنازل العشرية",
            "rounds down to an integer": "تقريب العدد إلى عدد صحيح",
            "rounds up to an integer": "تقريب العدد إلى عدد صحيح",
            "selector expected": "تم توقع محدد",
            "semi-colon expected": "تم توقع فاصلة منقوطة",
            "sine function": "دالة الجيب",
            "string literal expected": "تم توقع سلسلة نصية حرفية",
            "string replace": "استبدال سلسلة نصية",
            "tangent function": "دالة المماس",
            "term expected": "تم توقع مصطلح",
            "unknown keyword": "كلمة مفتاحية غير معروفة",
            "uri or string expected": "تم توقع URI أو سلسلة نصية",
            "variable name expected": "تم توقع اسم متغير",
            "variable value expected": "تم توقع قيمة المتغير",
            "whitespace expected": "تم توقع مساحة فارغة",
            "wildcard expected": "تم توقع حرف عام",
            "{ expected": "تم توقع {",
            "{0}, '{1}'": "{0},",
            "} expected": "تم توقع }"
        },
        "package": {
            "description": "يوفر دعمًا موسعًا للغة ملفات HTML وHandlebar",
            "displayName": "ميزات لغة HTML",
            "html.autoClosingTags": "تمكين أو تعطيل إغلاق العلامات HTML تلقائيًا.",
            "html.autoCreateQuotes": "تمكين أو تعطيل إنشاء علامات الاقتباس تلقائيًا عند تخصيص سمات HTML. يمكن لـ '#html.completion.attributeDefaultValue#' تكوين نوع علامات الاقتباس.",
            "html.completion.attributeDefaultValue": "يتحكم في القيمة الافتراضية للسمات عند قبول الإكمال التلقائي.",
            "html.completion.attributeDefaultValue.doublequotes": "يتم تعيين قيمة السمة إلى \"\".",
            "html.completion.attributeDefaultValue.empty": "قيمة السمة غير محددة.",
            "html.completion.attributeDefaultValue.singlequotes": "يتم تعيين قيمة السمة إلى ''.",
            "html.customData.desc": "قائمة من المسارات النسبية التي تشير إلى ملفات JSON التي تتبع [تنسيق البيانات المخصصة](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nيقوم VS Code بتحميل البيانات المخصصة عند بدء التشغيل لتحسين دعم HTML للعلامات HTML المخصصة والسمات والقيم التي تحددها في ملفات JSON.\r\n\r\nالمسارات هي مسارات نسبية إلى مساحة العمل ويتم أخذ إعدادات مجلد مساحة العمل فقط في الاعتبار.",
            "html.format.contentUnformatted.desc": "قائمة بالعلامات، مفصولة بفواصل، التي لا يجب إعادة تنسيق المحتوى بداخلها. يتم تعيين القيمة الافتراضية لـ \"null\" على العلامة \"pre\".",
            "html.format.enable.desc": "تمكين أو تعطيل المحرر HTML الافتراضي.",
            "html.format.extraLiners.desc": "قائمة بالعلامات، مفصولة بفواصل، التي يجب أن تحتوي على سطر إضافي قبلها. القيمة الافتراضية لـ \"null\" هي \"head, body, /html\".",
            "html.format.indentHandlebars.desc": "تنسيق ومسافة بادئة لـ {{#foo}} و{{/foo}}.",
            "html.format.indentInnerHtml.desc": "تطبيق المسافة البادئة على الأقسام \"<head>\" و\"<body>\".",
            "html.format.maxPreserveNewLines.desc": "العدد الأقصى للأسطر التي يجب الاحتفاظ بها في قطعة. استخدم \"null\" لجعل العدد غير محدود.",
            "html.format.preserveNewLines.desc": "يتحكم فيما إذا كان يجب الحفاظ على الأسطر الجديدة الموجودة أمام العناصر. يعمل فقط أمام العناصر، وليس داخل العلامات أو مع النصوص.",
            "html.format.templating.desc": "احترام علامات لغات القوالب مثل django وerb وhandlebars وphp.",
            "html.format.unformatted.desc": "قائمة بالعلامات، مفصولة بفواصل، التي لا يجب إعادة تنسيقها. القيمة الافتراضية لـ \"null\" هي جميع العلامات المعروضة على https://www.w3.org/TR/html5/dom.html#phrasing-content.",
            "html.format.unformattedContentDelimiter.desc": "تجميع محتوى النص بين هذه السلسلة.",
            "html.format.wrapAttributes.alignedmultiple": "ضبط عند تجاوز طول السطر ومحاذاة السمات عموديًا.",
            "html.format.wrapAttributes.auto": "ضبط السمات فقط عند تجاوز طول السطر.",
            "html.format.wrapAttributes.desc": "ضبط السمات.",
            "html.format.wrapAttributes.force": "ضبط جميع السمات باستثناء الأولى.",
            "html.format.wrapAttributes.forcealign": "ضبط جميع السمات باستثناء الأولى مع الحفاظ على المحاذاة.",
            "html.format.wrapAttributes.forcemultiline": "ضبط جميع السمات.",
            "html.format.wrapAttributes.preserve": "الحفاظ على إعدادات ضبط السمات.",
            "html.format.wrapAttributes.preservealigned": "الحفاظ على إعدادات ضبط السمات مع محاذاة.",
            "html.format.wrapAttributesIndentSize.desc": "تطبيق مسافة بادئة على السمات المضبوطة بعد N حرفًا. استخدم \"null\" لاستخدام حجم المسافة البادئة الافتراضي. يتم تجاهلها إذا تم تعيين \"#html.format.wrapAttributes#\" إلى \"aligned\".",
            "html.format.wrapLineLength.desc": "العدد الأقصى للحروف في السطر (0 = تعطيل).",
            "html.hover.documentation": "عرض وثائق السمات والعلامات عند المرور بالماوس.",
            "html.hover.references": "عرض المراجع إلى MDN عند المرور بالماوس.",
            "html.mirrorCursorOnMatchingTag": "تمكين أو تعطيل عكس المؤشر في العلامة HTML المطابقة.",
            "html.mirrorCursorOnMatchingTagDeprecationMessage": "تم إيقافه لصالح \"editor.linkedEditing\"",
            "html.suggest.html5.desc": "يتحكم في ما إذا كان دعم HTML المدمج يقترح العلامات والخصائص والقيم الخاصة بـ HTML5.",
            "html.trace.server.desc": "يتتبع الاتصال بين VSCode وخادم لغة HTML.",
            "html.validate.scripts": "يتحكم في ما إذا كان دعم لغة HTML المدمج يتحقق من صحة السكربتات المدمجة.",
            "html.validate.styles": "يتحكم في ما إذا كان دعم لغة HTML المدمج يتحقق من صحة الأنماط المدمجة."
        }
    }
}