{
    "": [
        "--------------------------------------------------------------------------------------------",
        "حقوق الطبع والنشر (c) Microsoft Corporation. جميع الحقوق محفوظة.",
        "مرخص بموجب رخصة MIT. راجع ملف License.txt في جذر المشروع لمعلومات الرخصة.",
        "--------------------------------------------------------------------------------------------",
        "لا تقم بتحرير هذا الملف. هو مولد آلي."
    ],
    "version": "1.0.0",
    "contents": {
        "bundle": {
            "\"store\" a boolean test for later evaluation in a guard or if().": "\"خزن\" اختبار بولياني للتقييم لاحقًا في guard أو if().",
            "'from' expected": "تم توقع \"from\"",
            "'in' expected": "تم توقع \"in\"",
            "'through' or 'to' expected": "تم توقع \"through\" أو \"to\"",
            "'{0}'": "'{0}'",
            "( expected": "تم توقع (",
            ") expected": "تم توقع )",
            "<undefined>": "<غير معرف>",
            "@font-face": "@font-face",
            "@font-face rule must define 'src' and 'font-family' properties": "يجب أن تعرف قاعدة @font-face خصائص 'src' و 'font-family'",
            "@keyframes {0}": "@keyframes {0}",
            "A list of properties that are not validated against the `unknownProperties` rule.": "قائمة الخصائص التي لا يتم التحقق منها ضد قاعدة \"unknownProperties\".",
            "Adds quotes to a string.": "إضافة علامات اقتباس إلى سلسلة.",
            "Also define the standard property '{0}' for compatibility": "تعريف الخاصية القياسية \"{0}\" من أجل التوافق",
            "Always define standard rule '@keyframes' when defining keyframes.": "دائمًا تعريف القاعدة القياسية \"@keyframes\" عند تعريف الإطارات الرئيسية.",
            "Always include all vendor specific properties: Missing: {0}": "دائمًا تضمين جميع الخصائص المحددة من قبل الموردين: مفقود: {0}",
            "Always include all vendor specific rules: Missing: {0}": "دائمًا تضمين جميع القواعد المحددة من قبل الموردين: مفقود: {0}",
            "Appends a single value onto the end of a list.": "إلحاق قيمة واحدة في نهاية القائمة.",
            "Appends selectors to one another without spaces in between.": "إلحاق المحددات ببعضها دون وجود مسافات بينها.",
            "Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "تجنب استخدام \"!important\". إنه يشير إلى أن خصوصية CSS بأكملها قد خرجت عن السيطرة وتحتاج إلى إعادة هيكلة.",
            "Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "تجنب استخدام \"float\". تؤدي القيم العائمة إلى CSS هشة وسهلة الكسر إذا تم تغيير أحد جوانب التصميم.",
            "CSS Language Server": "خادم لغة CSS",
            "CSS fix is outdated and can't be applied to the document.": "تصحيح CSS قديم ولا يمكن تطبيقه على المستند.",
            "Causes one or more rules to be emitted at the root of the document.": "يتسبب في إصدار قاعدة أو أكثر في جذر المستند.",
            "Changes one or more properties of a color.": "تغيير واحدة أو أكثر من خصائص اللون.",
            "Changes the alpha component for a color.": "تغيير مكون ألفا للون.",
            "Changes the hue of a color.": "تغيير لون اللون.",
            "Combines several lists into a single multidimensional list.": "دمج عدة قوائم في قائمة متعددة الأبعاد واحدة.",
            "Converts a color into the format understood by IE filters.": "تحويل اللون إلى الصيغة التي تفهمها فلاتر IE.",
            "Converts a color to grayscale.": "تحويل اللون إلى درجات الرمادي.",
            "Converts a string to lower case.": "تحويل السلسلة إلى الحروف الصغيرة.",
            "Converts a string to upper case.": "تحويل السلسلة إلى الحروف الكبيرة.",
            "Converts a unitless number to a percentage.": "تحويل رقم بدون وحدة إلى نسبة مئوية.",
            "Creates a Color from hue, saturation, and lightness values.": "إنشاء لون من قيم التدرج اللوني والتشبع والسطوع.",
            "Creates a Color from hue, saturation, lightness, and alpha values.": "إنشاء لون من قيم التدرج اللوني والتشبع والسطوع وألفا.",
            "Creates a Color from hue, white, and black values.": "إنشاء لون من قيم التدرج اللوني والأبيض والأسود.",
            "Creates a Color from lightness, a, and b values.": "إنشاء لون من قيم السطوع و a و b.",
            "Creates a Color from lightness, chroma, and hue values.": "إنشاء لون من قيم السطوع والكروما والتدرج اللوني.",
            "Creates a Color from red, green, and blue values.": "إنشاء لون من قيم الأحمر والأخضر والأزرق.",
            "Creates a Color from red, green, blue, and alpha values.": "إنشاء لون من قيم الأحمر والأخضر والأزرق وألفا.",
            "Creates a Color from the hue, saturation, and lightness values of another Color.": "إنشاء لون من قيم التدرج اللوني والتشبع والسطوع للون آخر.",
            "Creates a Color from the hue, white, and black values of another Color.": "إنشاء لون من قيم التدرج اللوني والأبيض والأسود للون آخر.",
            "Creates a Color from the lightness, a, and b values of another Color.": "إنشاء لون من قيم السطوع و a و b للون آخر.",
            "Creates a Color from the lightness, chroma, and hue values of another Color.": "إنشاء لون من قيم السطوع والكروما والتدرج اللوني للون آخر.",
            "Creates a Color from the red, green, and blue values of another Color.": "إنشاء لون من قيم الأحمر والأخضر والأزرق للون آخر.",
            "Creates a Color in a specific color space from red, green, and blue values.": "إنشاء لون في مساحة لونية محددة من قيم الأحمر والأخضر والأزرق.",
            "Creates a Color in a specific color space from the red, green, and blue values of another Color.": "إنشاء لون في مساحة لونية محددة من قيم الأحمر والأخضر والأزرق للون آخر.",
            "Defines complex operations that can be re-used throughout stylesheets.": "تعريف العمليات المعقدة التي يمكن إعادة استخدامها في جميع أوراق الأنماط.",
            "Defines styles that can be re-used throughout the stylesheet with `@include`.": "تعريف الأنماط التي يمكن إعادة استخدامها في جميع ورقة الأنماط باستخدام `@include`.",
            "Do not use duplicate style definitions": "لا تستخدم تعريفات أنماط مكررة",
            "Do not use empty rulesets": "لا تستخدم مجموعات القواعد الفارغة",
            "Do not use width or height when using padding or border": "لا تستخدم العرض أو الارتفاع عند استخدام الحشو أو الحدود.",
            "Dynamically calls a Sass function.": "استدعاء دالة Sass ديناميكيًا.",
            "Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "كل حلقة تحدد \"$var\" لكل عنصر في القائمة أو الخريطة، ثم تخرج الأنماط التي تحتوي عليها باستخدام قيمة \"$var\".",
            "Exposes the details of Sass’s inner workings.": "يعرض تفاصيل العمليات الداخلية لـ Sass.",
            "Extends $extendee with $extender within $selector.": "تمديد $extendee مع $extender داخل $selector.",
            "Extracts a substring from $string.": "استخراج جزء من السلسلة من $string.",
            "Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "فشل تطبيق تصحيح CSS على المستند. يرجى النظر في فتح قضية مع خطوات الاستنساخ.",
            "Finds the maximum of several numbers.": "البحث عن الحد الأقصى لعدة أرقام.",
            "Finds the minimum of several numbers.": "البحث عن الحد الأدنى لعدة أرقام.",
            "Fluidly scales one or more properties of a color.": "توسيع سائل لخاصية أو أكثر من خصائص اللون.",
            "Folding Region End": "نهاية منطقة الطي",
            "Folding Region Start": "بداية منطقة الطي",
            "For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "حلقة For التي تخرج بشكل متكرر مجموعة من الأنماط لكل \"$var\" في جملة `from/through` أو `from/to`.",
            "Generates new colors based on existing ones, making it easy to build color themes.": "إنشاء ألوان جديدة بناءً على الألوان الموجودة، مما يسهل بناء سمات الألوان.",
            "Gets the blue component of a color.": "الحصول على المكون الأزرق للون.",
            "Gets the green component of a color.": "الحصول على المكون الأخضر للون.",
            "Gets the hue component of a color.": "الحصول على مكون التدرج اللوني للون.",
            "Gets the lightness component of a color.": "الحصول على مكون السطوع للون.",
            "Gets the opacity component of a color.": "الحصول على مكون الشفافية للون.",
            "Gets the red component of a color.": "الحصول على المكون الأحمر للون.",
            "Gets the saturation component of a color.": "الحصول على مكون التشبع للون.",
            "Hex colors must consist of three, four, six or eight hex numbers": "يجب أن تتكون الألوان السداسية عشرية من ثلاثة أو أربعة أو ستة أو ثمانية أرقام سداسية عشرية.",
            "IE hacks are only necessary when supporting IE7 and older": "تعديلات IE ضرورية فقط عند دعم IE7 والإصدارات الأقدم.",
            "Import statements do not load in parallel": "بيانات الاستيراد لا يتم تحميلها بشكل متوازٍ.",
            "Includes the body if the expression does not evaluate to `false` or `null`.": "يتضمن الجسم إذا كانت التعبير لا يقيم إلى `false` أو `null`.",
            "Includes the styles defined by another mixin into the current rule.": "يتضمن الأنماط التي يتم تعريفها بواسطة مزيج آخر في القاعدة الحالية.",
            "Increases or decreases one or more components of a color.": "زيادة أو تقليل مكون أو أكثر من مكونات اللون.",
            "Inherits the styles of another selector.": "وراثة الأنماط من محدد آخر.",
            "Insert url() Function": "إدراج دالة url()",
            "Insert url() Functions": "إدراج دوال url()",
            "Inserts $insert into $string at $index.": "إدراج $insert في $string عند $index.",
            "Invalid number of parameters": "عدد المعاملات غير صالح",
            "Joins together two lists into one.": "دمج قائمتين معًا في واحدة.",
            "Lets you access and modify values in lists.": "يتيح لك الوصول إلى القيم في القوائم وتعديلها.",
            "Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "تحميل ورقة أنماط Sass ويجعل المزيجات والدوال والمتغيرات متاحة عند تحميل هذه الورقة باستخدام قاعدة @use.",
            "Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "تحميل المزيجات والدوال والمتغيرات من أوراق أنماط Sass أخرى كـ \"وحدات\"، ودمج CSS من عدة أوراق أنماط معًا.",
            "Makes a color darker.": "يجعل اللون أغمق.",
            "Makes a color less saturated.": "يجعل اللون أقل تشبعًا.",
            "Makes a color lighter.": "يجعل اللون أكثر إشراقًا.",
            "Makes a color more opaque.": "يجعل اللون أكثر كثافة.",
            "Makes a color more saturated.": "يجعل اللون أكثر تشبعًا.",
            "Makes a color more transparent.": "يجعل اللون أكثر شفافية.",
            "Makes it easy to combine, search, or split apart strings.": "يسهل دمج السلاسل النصية أو البحث عنها أو تقسيمها.",
            "Makes it possible to look up the value associated with a key in a map, and much more.": "يجعل من الممكن البحث عن القيمة المرتبطة بمفتاح في الخريطة، وأكثر من ذلك.",
            "Merges two maps together into a new map.": "دمج خريطتين معًا في خريطة جديدة.",
            "Mix two colors together in a polar color space.": "مزج لونين معًا في مساحة لونية قطبية.",
            "Mix two colors together in a rectangular color space.": "مزج لونين معًا في مساحة لونية مستطيلة.",
            "Mixes two colors together.": "مزيج من لونين معًا.",
            "Nests selector beneath one another like they would be nested in the stylesheet.": "عشْ المحددات تحت بعضها كما ستكون مدرجة في ورقة الأنماط.",
            "No unit for zero needed": "لا حاجة إلى وحدة لصفر",
            "Parses a selector into the format returned by &.": "تحليل محدد إلى التنسيق الذي يتم إرجاعه بواسطة &.",
            "Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "طباعة قيمة تعبير في تدفق الإخراج القياسي للأخطاء. مفيد لتصحيح أخطاء ملفات Sass المعقدة.",
            "Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "طباعة قيمة تعبير في تدفق الإخراج القياسي للأخطاء. مفيد للمكتبات التي تحتاج إلى تحذير المستخدمين من استخدامات قديمة أو استعادة الأخطاء الصغيرة في استخدام المزيج. يمكن تعطيل التحذيرات باستخدام الخيار `--quiet` في سطر الأوامر أو خيار Sass `:quiet`.",
            "Property is ignored due to the display.": "يتم تجاهل الخاصية بسبب العرض.",
            "Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "يتم تجاهل الخاصية بسبب العرض. مع 'display: block'، يجب عدم استخدام محاذاة رأسية.",
            "Provides access to Sass’s powerful selector engine.": "يوفر الوصول إلى محرك محددات Sass القوي.",
            "Provides functions that operate on numbers.": "يوفر دوالًا تعمل على الأرقام.",
            "Removes quotes from a string.": "إزالة العلامات من السلسلة.",
            "Rename to '{0}'": "إعادة التسمية إلى \"{0}\"",
            "Replaces $original with $replacement within $selector.": "استبدال $original بـ $replacement داخل $selector.",
            "Replaces the nth item in a list.": "استبدال العنصر nth في القائمة.",
            "Returns a list of all keys in a map.": "إرجاع قائمة من جميع المفاتيح في خريطة.",
            "Returns a list of all values in a map.": "إرجاع قائمة من جميع القيم في خريطة.",
            "Returns a new map with keys removed.": "إرجاع خريطة جديدة مع المفاتيح المحذوفة.",
            "Returns a random number.": "إرجاع رقم عشوائي.",
            "Returns a specific item in a list.": "إرجاع عنصر معين في قائمة.",
            "Returns the absolute value of a number.": "إرجاع القيمة المطلقة لعدد.",
            "Returns the complement of a color.": "إرجاع مكمل اللون.",
            "Returns the index of the first occurance of $substring in $string.": "إرجاع فهرس أول حدوث لـ $substring في $string.",
            "Returns the inverse of a color.": "إرجاع معكوس اللون.",
            "Returns the keywords passed to a function that takes variable arguments.": "إرجاع الكلمات المفتاحية التي تم تمريرها إلى دالة تأخذ معطيات متغيرة.",
            "Returns the length of a list.": "إرجاع طول قائمة.",
            "Returns the number of characters in a string.": "إرجاع عدد الأحرف في سلسلة.",
            "Returns the position of a value within a list.": "إرجاع موقع قيمة داخل قائمة.",
            "Returns the separator of a list.": "إرجاع فاصل قائمة.",
            "Returns the simple selectors that comprise a compound selector.": "إرجاع المحددات البسيطة التي تتضمن محددًا مركبًا.",
            "Returns the string representation of a value as it would be represented in Sass.": "إرجاع التمثيل النصي لقيمة كما سيتم تمثيلها في Sass.",
            "Returns the type of a value.": "إرجاع نوع القيمة.",
            "Returns the unit(s) associated with a number.": "إرجاع الوحدة أو الوحدات المرتبطة بعدد.",
            "Returns the value in a map associated with a given key.": "إرجاع القيمة في خريطة مرتبطة بمفتاح معين.",
            "Returns whether $super matches all the elements $sub does, and possibly more.": "إرجاع ما إذا كان $super يتطابق مع جميع العناصر التي تتطابق معها $sub، وربما أكثر.",
            "Returns whether a feature exists in the current Sass runtime.": "إرجاع ما إذا كانت خاصية موجودة في بيئة تشغيل Sass الحالية.",
            "Returns whether a function with the given name exists.": "إرجاع ما إذا كانت دالة بالاسم المعطى موجودة.",
            "Returns whether a map has a value associated with a given key.": "إرجاع ما إذا كانت الخريطة تحتوي على قيمة مرتبطة بمفتاح معين.",
            "Returns whether a mixin with the given name exists.": "إرجاع ما إذا كان هناك مزيج بالاسم المعطى.",
            "Returns whether a number has units.": "إرجاع ما إذا كان الرقم يحتوي على وحدات.",
            "Returns whether a variable with the given name exists in the current scope.": "إرجاع ما إذا كانت هناك متغيرات بالاسم المعطى في النطاق الحالي.",
            "Returns whether a variable with the given name exists in the global scope.": "إرجاع ما إذا كانت هناك متغيرات بالاسم المعطى في النطاق العام.",
            "Returns whether two numbers can be added, subtracted, or compared.": "إرجاع ما إذا كان يمكن جمع أو طرح أو مقارنة رقمين.",
            "Rounds a number down to the previous whole number.": "تقريب الرقم إلى الرقم الصحيح السابق.",
            "Rounds a number to the nearest whole number.": "تقريب الرقم إلى أقرب عدد صحيح.",
            "Rounds a number up to the next whole number.": "تقريب الرقم إلى العدد الصحيح التالي.",
            "Sass documentation": "توثيق Sass",
            "Selector Specificity": "خصوصية المحدد",
            "Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "يجب ألا تحتوي المحددات على معرّفات لأن هذه القواعد مرتبطة بشكل وثيق مع HTML.",
            "The universal selector (*) is known to be slow": "من المعروف أن المحدد العام (*) بطيء.",
            "Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "إلقاء قيمة التعبير كخطأ فادح مع تتبع المكدس. مفيد للتحقق من صحة المعاملات في المزيجات والدوال.",
            "URI expected": "تم توقع URI",
            "URL encodes a string": "ترميز URL لسلسلة",
            "Unifies two selectors to produce a selector that matches elements matched by both.": "توحيد محددين لإنتاج محدد يتطابق مع العناصر المتطابقة مع كليهما.",
            "Unknown at-rule.": "قاعدة at غير معروفة.",
            "Unknown property.": "خاصية غير معروفة.",
            "Unknown property: '{0}'": "خاصية غير معروفة: \"{0}\"",
            "Unknown vendor specific property.": "خاصية محددة للبائع غير معروفة.",
            "When using a vendor-specific prefix also include the standard property": "عند استخدام بادئة محددة للبائع، قم أيضًا بتضمين الخاصية القياسية.",
            "When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "عند استخدام بادئة محددة للبائع، تأكد من تضمين جميع الخصائص الأخرى المحددة للبائع.",
            "While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "حلقة While التي تأخذ تعبيرًا وتخرج الأنماط المتداخلة بشكل متكرر حتى يتم تقييم البيان إلى `false`.",
            "[ expected": "تم توقع [",
            "] expected": "تم توقع ]",
            "absolute value of a number": "القيمة المطلقة للعدد",
            "arccosine - inverse of cosine function": "الزاوية العكسية - معكوس دالة جيب التمام",
            "arcsine - inverse of sine function": "الزاوية العكسية - معكوس دالة الجيب",
            "arctangent - inverse of tangent function": "الزاوية العكسية - معكوس دالة الظل",
            "argument from '{0}'": "معامل من \"{0}\"",
            "at-rule or selector expected": "تم توقع قاعدة at-rule أو محدد",
            "at-rule unknown": "قاعدة at-rule غير معروفة",
            "bind the evaluation of a ruleset to each member of a list.": "ربط تقييم مجموعة القواعد بكل عضو في قائمة.",
            "calculates square root of a number": "حساب الجذر التربيعي لعدد",
            "colon expected": "تم توقع نقطتين",
            "comma expected": "تم توقع فاصلة",
            "condition expected": "تم توقع شرط",
            "converts numbers from one type into another": "تحويل الأرقام من نوع إلى آخر",
            "converts to a %, e.g. 0.5 > 50%": "التحويل إلى نسبة مئوية، مثل 0.5 > 50%",
            "cosine function": "دالة جيب التمام",
            "creates a #AARRGGBB": "إنشاء #AARRGGBB",
            "creates a color": "إنشاء لون",
            "dot expected": "تم توقع نقطة",
            "escape string content": "محتوى سلسلة الهروب",
            "expression expected": "تم توقع تعبير",
            "first argument modulus second argument": "أول معامل موديولوس ثاني معامل",
            "first argument raised to the power of the second argument": "أول معامل مرفوع إلى قوة المعامل الثاني",
            "generate a list spanning a range of values": "إنشاء قائمة تمتد عبر نطاق من القيم",
            "identifier expected": "تم توقع معرف",
            "identifier or variable expected": "تم توقع معرف أو متغير",
            "identifier or wildcard expected": "تم توقع معرف أو حرف بدل",
            "inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "\"inline-block\" يتم تجاهله بسبب \"float\". إذا كانت قيمة \"float\" غير \"none\"، يتم تعويم الصندوق ويتم التعامل مع \"display\" كـ \"block\"",
            "inlines a resource and falls back to `url()`": "وضع مورد في السطر والرجوع إلى `url()`",
            "media query expected": "تم توقع استعلام الوسائط",
            "number expected": "تم توقع رقم",
            "operator expected": "تم توقع مشغل",
            "page directive or declaraton expected": "تم توقع توجيه الصفحة أو إعلان",
            "parses a string to a color": "تحليل سلسلة إلى لون",
            "percentage expected": "تم توقع نسبة مئوية",
            "property value expected": "تم توقع قيمة الخاصية",
            "remove or change the unit of a dimension": "إزالة أو تغيير وحدة الأبعاد",
            "return `@color` 10% points darker": "إرجاع `@color` مع 10% نقاط أكثر ظلمة",
            "return `@color` 10% points less saturated": "إرجاع `@color` مع 10% نقاط أقل تشبعًا",
            "return `@color` 10% points less transparent": "إرجاع `@color` مع 10% نقاط أقل شفافية",
            "return `@color` 10% points lighter": "إرجاع `@color` مع 10% نقاط أكثر سطوعًا",
            "return `@color` 10% points more saturated": "إرجاع `@color` مع 10% نقاط أكثر تشبعًا",
            "return `@color` 10% points more transparent": "إرجاع `@color` مع 10% نقاط أكثر شفافية",
            "return `@color` with 50% transparency": "إرجاع `@color` مع شفافية 50%",
            "return `@color` with a 10 degree larger in hue": "إرجاع `@color` مع تغيير 10 درجات في التدرج اللوني",
            "return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "إرجاع `@darkcolor` إذا كانت `@color1 is> 43% luma`؛ وإلا إرجاع `@lightcolor`. راجع الملاحظات.",
            "return a mix of `@color1` and `@color2`": "إرجاع مزيج من `@color1` و `@color2`",
            "returns a grey, 100% desaturated color": "إرجاع لون رمادي، 100% غير مشبع",
            "returns a value at the specified position in the list": "إرجاع قيمة في الموضع المحدد في القائمة",
            "returns one of two values depending on a condition.": "إرجاع أحد القيمتين بناءً على شرط.",
            "returns pi": "إرجاع قيمة باي",
            "returns the `alpha` channel of `@color`": "إرجاع قناة `alpha` من `@color`",
            "returns the `blue` channel of `@color`": "إرجاع قناة `blue` من `@color`",
            "returns the `green` channel of `@color`": "إرجاع قناة `green` من `@color`",
            "returns the `hue` channel of `@color` in the HSL space": "إرجاع قناة `hue` من `@color` في مساحة HSL",
            "returns the `hue` channel of `@color` in the HSV space": "إرجاع قناة `hue` من `@color` في مساحة HSV",
            "returns the `lightness` channel of `@color` in the HSL space": "إرجاع قناة `lightness` من `@color` في مساحة HSL",
            "returns the `luma` value (perceptual brightness) of `@color`": "إرجاع قيمة `luma` (السطوع المدرك) من `@color`",
            "returns the `red` channel of `@color`": "إرجاع قناة `red` من `@color`",
            "returns the `saturation` channel of `@color` in the HSL space": "إرجاع قناة `saturation` من `@color` في مساحة HSL",
            "returns the `saturation` channel of `@color` in the HSV space": "إرجاع قناة `saturation` من `@color` في مساحة HSV",
            "returns the `value` channel of `@color` in the HSV space": "إرجاع قناة `value` من `@color` في مساحة HSV",
            "returns the lowest of one or more values": "إرجاع أدنى قيمة من قيمة أو أكثر",
            "returns the number of elements in a value list": "إرجاع عدد العناصر في قائمة القيم",
            "rounds a number to a number of places": "تقريب عدد إلى عدد من الأماكن",
            "rounds down to an integer": "تقريب إلى عدد صحيح",
            "rounds up to an integer": "تقريب إلى عدد صحيح",
            "selector expected": "تم توقع محدد",
            "semi-colon expected": "تم توقع فاصلة منقوطة",
            "sine function": "دالة الجيب",
            "string literal expected": "تم توقع نص حرفي",
            "string replace": "استبدال السلسلة",
            "tangent function": "دالة الظل",
            "term expected": "تم توقع مصطلح",
            "unknown keyword": "كلمة مفتاحية غير معروفة",
            "uri or string expected": "تم توقع URI أو سلسلة",
            "variable name expected": "تم توقع اسم متغير",
            "variable value expected": "تم توقع قيمة متغير",
            "whitespace expected": "تم توقع فراغ",
            "wildcard expected": "تم توقع حرف بدل",
            "{ expected": "تم توقع {",
            "{0}, '{1}'": "{0}, \"{1}\"",
            "} expected": "تم توقع }"
        },
        "package": {
            "css.colorDecorators.enable.deprecationMessage": "قيمة \"css.colorDecorators.enable\" قديمة وتم استبدالها بـ \"editor.colorDecorators\".",
            "css.completion.completePropertyWithSemicolon.desc": "أضف نقطة فاصلة في نهاية السطر عند إتمام خصائص CSS.",
            "css.completion.triggerPropertyValueCompletion.desc": "بشكل افتراضي، يقوم VS Code بتفعيل إتمام القيم عند تحديد خاصية CSS. استخدم هذا الخيار لتعطيل هذا السلوك.",
            "css.customData.desc": "قائمة من المسارات الخاصة بالملفات التي تشير إلى ملفات JSON تتبع [تنسيق البيانات المخصصة](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md). \r\n\r\nيتم تحميل البيانات المخصصة في بداية العمل لتحسين دعم CSS للخصائص المخصصة (المتغيرات)، القواعد، الفئات الفرعية والعناصر الفرعية التي تحددها في ملفات JSON.\r\n\r\nالمسارات هي نسبية لمجلد مساحة العمل ويتم أخذ إعدادات مجلد مساحة العمل فقط في الاعتبار.",
            "css.format.braceStyle.desc": "ضع الأقواس في نفس السطر مع القواعد ('collapse') أو ضع الأقواس في سطر منفصل ('expand').",
            "css.format.enable.desc": "تفعيل أو تعطيل أداة التنسيق CSS الافتراضية.",
            "css.format.maxPreserveNewLines.desc": "أقصى عدد من الأسطر الفارغة التي سيتم الاحتفاظ بها في المقتطف عند تفعيل `#css.format.preserveNewLines#`.",
            "css.format.newlineBetweenRules.desc": "فصل مجموعات القواعد مع سطر فارغ.",
            "css.format.newlineBetweenSelectors.desc": "فصل المحددات مع سطر جديد.",
            "css.format.preserveNewLines.desc": "تحديد ما إذا كان يجب الحفاظ على الأسطر الفارغة الموجودة قبل القواعد والإعلانات.",
            "css.format.spaceAroundSelectorSeparator.desc": "تأكد من وجود فراغ حول فواصل المحددات '>', '+', '~' (على سبيل المثال، 'a > b').",
            "css.hover.documentation": "عرض التوثيق الخاص بالخصائص والقيم عند التحويم في CSS.",
            "css.hover.references": "عرض المراجع من MDN عند التحويم على خصائص CSS.",
            "css.lint.argumentsInColorFunction.desc": "عدد المعاملات غير صحيح.",
            "css.lint.boxModel.desc": "لا تستخدم \"width\" أو \"height\" عند استخدام \"padding\" أو \"border\".",
            "css.lint.compatibleVendorPrefixes.desc": "عند استخدام بادئة المورد، تأكد من تضمين جميع خصائص المورد الأخرى.",
            "css.lint.duplicateProperties.desc": "لا تستخدم تعريفات الأنماط المكررة.",
            "css.lint.emptyRules.desc": "لا تستخدم مجموعات القواعد الفارغة.",
            "css.lint.float.desc": "تجنب استخدام \"float\". يؤدي ذلك إلى CSS هش يمكن كسره بسهولة إذا تم تغيير أي جزء من التصميم.",
            "css.lint.fontFaceProperties.desc": "يجب أن تعرف قاعدة \"@font-face\" خصائص \"src\" و \"font-family\".",
            "css.lint.hexColorLength.desc": "يجب أن تتكون الألوان السداسية من 3 أو 4 أو 6 أو 8 أرقام سداسية عشرية.",
            "css.lint.idSelector.desc": "يجب ألا تحتوي المحددات على معرفات لأن هذه القواعد مرتبطة بشكل وثيق مع HTML.",
            "css.lint.ieHack.desc": "التعديلات الخاصة بـ IE ضرورية فقط عند دعم IE7 والإصدارات الأقدم.",
            "css.lint.importStatement.desc": "تعليمات الاستيراد لا يتم تحميلها بالتوازي.",
            "css.lint.important.desc": "تجنب استخدام `!important`. يشير إلى أن خصوصية CSS بأكملها قد خرجت عن السيطرة وتحتاج إلى إعادة الهيكلة.",
            "css.lint.propertyIgnoredDueToDisplay.desc": "يتم تجاهل الخاصية بسبب العرض. على سبيل المثال، مع \"display: inline\"، الخصائص مثل \"width\" و \"height\" و \"margin-top\" و \"margin-bottom\" و \"float\" لا تؤثر.",
            "css.lint.universalSelector.desc": "من المعروف أن المحدد العام (*) بطيء.",
            "css.lint.unknownAtRules.desc": "قاعدة at-rule غير معروفة.",
            "css.lint.unknownProperties.desc": "خاصية غير معروفة.",
            "css.lint.unknownVendorSpecificProperties.desc": "خاصية محددة للبائع غير معروفة.",
            "css.lint.validProperties.desc": "قائمة الخصائص التي لا يتم التحقق منها باستخدام قاعدة \"unknownProperties\".",
            "css.lint.vendorPrefix.desc": "عند استخدام بادئة المورد، تأكد من تضمين الخاصية القياسية أيضًا.",
            "css.lint.zeroUnits.desc": "لا حاجة لوحدة عند استخدام الصفر.",
            "css.title": "CSS",
            "css.trace.server.desc": "يتتبع الاتصال بين VS Code وخادم لغة CSS.",
            "css.validate.desc": "تفعيل أو تعطيل جميع التحقق من الصحة.",
            "css.validate.title": "يتحكم في التحقق من الصحة ودرجة أهمية المشكلات في CSS.",
            "description": "يوفر دعمًا قويًا للغة CSS و LESS و SCSS.",
            "displayName": "ميزات لغة CSS",
            "less.colorDecorators.enable.deprecationMessage": "قيمة \"less.colorDecorators.enable\" أصبحت قديمة وتم استبدالها بـ \"editor.colorDecorators\".",
            "less.completion.completePropertyWithSemicolon.desc": "إدراج نقطة فاصلة في نهاية السطر عند إتمام خصائص CSS.",
            "less.completion.triggerPropertyValueCompletion.desc": "بشكل افتراضي، يقوم VS Code بتفعيل إتمام القيم بعد اختيار خاصية CSS. استخدم هذا الخيار لتعطيل هذا السلوك.",
            "less.format.braceStyle.desc": "ضع الأقواس في نفس السطر مع القواعد ('collapse') أو ضع الأقواس في سطر منفصل ('expand').",
            "less.format.enable.desc": "تفعيل أو تعطيل أداة تنسيق LESS الافتراضية.",
            "less.format.maxPreserveNewLines.desc": "أقصى عدد من الأسطر الفارغة التي ستتم المحافظة عليها في المقتطف عند تفعيل `#less.format.preserveNewLines#`.",
            "less.format.newlineBetweenRules.desc": "افصل مجموعات القواعد بسطر فارغ.",
            "less.format.newlineBetweenSelectors.desc": "افصل المحددات بسطر جديد.",
            "less.format.preserveNewLines.desc": "تحديد ما إذا كان يجب الحفاظ على الأسطر الفارغة الحالية قبل القواعد والإعلانات.",
            "less.format.spaceAroundSelectorSeparator.desc": "تأكد من وجود فراغ حول فواصل المحددات '>', '+', '~' (على سبيل المثال، 'a > b').",
            "less.hover.documentation": "عرض التوثيق للخصائص والقيم عند التمرير فوق LESS.",
            "less.hover.references": "عرض المراجع من MDN عند التمرير فوق خصائص LESS.",
            "less.lint.argumentsInColorFunction.desc": "عدد المعاملات غير صحيح.",
            "less.lint.boxModel.desc": "لا تستخدم \"width\" أو \"height\" عند استخدام \"padding\" أو \"border\".",
            "less.lint.compatibleVendorPrefixes.desc": "عند استخدام بادئة المورد، تأكد من تضمين جميع الخصائص المحددة للبائع.",
            "less.lint.duplicateProperties.desc": "لا تستخدم تعريفات الأنماط المكررة.",
            "less.lint.emptyRules.desc": "لا تستخدم مجموعات القواعد الفارغة.",
            "less.lint.float.desc": "من الأفضل عدم استخدام \"float\". القيم العائمة تؤدي إلى CSS هش قد يتكسر بسهولة عند تغيير أي جانب من جوانب التصميم.",
            "less.lint.fontFaceProperties.desc": "يجب أن تعرف قاعدة \"@font-face\" خصائص \"src\" و \"font-family\".",
            "less.lint.hexColorLength.desc": "يجب أن تتكون الألوان السداسية من 3 أو 4 أو 6 أو 8 أرقام سداسية عشرية.",
            "less.lint.idSelector.desc": "لا يجب أن تحتوي المحددات على معرفات لأن هذه القواعد مرتبطة ارتباطًا وثيقًا بـ HTML.",
            "less.lint.ieHack.desc": "التعديلات الخاصة بـ IE ضرورية فقط عند دعم IE7 والإصدارات الأقدم.",
            "less.lint.importStatement.desc": "تعليمات الاستيراد لا يتم تحميلها بالتوازي.",
            "less.lint.important.desc": "تجنب استخدام `!important`. إنها تشير إلى أن خصوصية CSS بالكامل خرجت عن السيطرة ويجب إعادة هيكلتها.",
            "less.lint.propertyIgnoredDueToDisplay.desc": "تم تجاهل الخاصية بسبب العرض. على سبيل المثال، مع \"display: inline\"، الخصائص مثل \"width\" و \"height\" و \"margin-top\" و \"margin-bottom\" و \"float\" لا تؤثر.",
            "less.lint.universalSelector.desc": "من المعروف أن المحدد العام (\"*\") بطيء.",
            "less.lint.unknownAtRules.desc": "قاعدة at-rule غير معروفة.",
            "less.lint.unknownProperties.desc": "خاصية غير معروفة.",
            "less.lint.unknownVendorSpecificProperties.desc": "خاصية محددة للبائع غير معروفة.",
            "less.lint.validProperties.desc": "قائمة الخصائص التي لا يتم التحقق منها باستخدام قاعدة \"unknownProperties\".",
            "less.lint.vendorPrefix.desc": "عند استخدام بادئة المورد، تأكد من تضمين الخاصية القياسية أيضًا.",
            "less.lint.zeroUnits.desc": "لا حاجة لوحدة عند استخدام الصفر.",
            "less.title": "LESS",
            "less.validate.desc": "تفعيل أو تعطيل جميع التحقق من الصحة.",
            "less.validate.title": "التحكم في التحقق من صحة LESS ودرجة خطورة المشكلات.",
            "scss.colorDecorators.enable.deprecationMessage": "قيمة \"scss.colorDecorators.enable\" أصبحت قديمة وتم استبدالها بـ \"editor.colorDecorators\".",
            "scss.completion.completePropertyWithSemicolon.desc": "إدراج نقطة فاصلة في نهاية السطر عند إتمام خصائص CSS.",
            "scss.completion.triggerPropertyValueCompletion.desc": "بشكل افتراضي، يقوم VS Code بتفعيل إتمام القيم بعد اختيار خاصية CSS. استخدم هذا الخيار لتعطيل هذا السلوك.",
            "scss.format.braceStyle.desc": "ضع الأقواس في نفس السطر مع القواعد ('collapse') أو ضع الأقواس في سطر منفصل ('expand').",
            "scss.format.enable.desc": "تفعيل أو تعطيل أداة تنسيق SCSS الافتراضية.",
            "scss.format.maxPreserveNewLines.desc": "أقصى عدد من الأسطر الفارغة التي ستتم المحافظة عليها في المقتطف عند تفعيل `#scss.format.preserveNewLines#`.",
            "scss.format.newlineBetweenRules.desc": "افصل مجموعات القواعد بسطر فارغ.",
            "scss.format.newlineBetweenSelectors.desc": "افصل المحددات بسطر جديد.",
            "scss.format.preserveNewLines.desc": "تحديد ما إذا كان يجب الحفاظ على الأسطر الفارغة الحالية قبل القواعد والإعلانات.",
            "scss.format.spaceAroundSelectorSeparator.desc": "تأكد من وجود فراغ حول فواصل المحددات '>', '+', '~' (على سبيل المثال، 'a > b').",
            "scss.hover.documentation": "عرض التوثيق للخصائص والقيم عند التمرير فوق SCSS.",
            "scss.hover.references": "عرض المراجع من MDN عند التمرير فوق خصائص SCSS.",
            "scss.lint.argumentsInColorFunction.desc": "عدد المعاملات غير صحيح.",
            "scss.lint.boxModel.desc": "لا تستخدم \"width\" أو \"height\" عند استخدام \"padding\" أو \"border\".",
            "scss.lint.compatibleVendorPrefixes.desc": "عند استخدام بادئة المورد، تأكد من تضمين جميع الخصائص المحددة للبائع.",
            "scss.lint.duplicateProperties.desc": "لا تستخدم تعريفات الأنماط المكررة.",
            "scss.lint.emptyRules.desc": "لا تستخدم مجموعات القواعد الفارغة.",
            "scss.lint.float.desc": "من الأفضل عدم استخدام \"float\". القيم العائمة تؤدي إلى CSS هش قد يتكسر بسهولة عند تغيير أي جانب من جوانب التصميم.",
            "scss.lint.fontFaceProperties.desc": "يجب أن تعرف قاعدة \"@font-face\" خصائص \"src\" و \"font-family\".",
            "scss.lint.hexColorLength.desc": "يجب أن تتكون الألوان السداسية من 3 أو 4 أو 6 أو 8 أرقام سداسية عشرية.",
            "scss.lint.idSelector.desc": "لا يجب أن تحتوي المحددات على معرفات لأن هذه القواعد مرتبطة ارتباطًا وثيقًا بـ HTML.",
            "scss.lint.ieHack.desc": "التعديلات الخاصة بـ IE ضرورية فقط عند دعم IE7 والإصدارات الأقدم.",
            "scss.lint.importStatement.desc": "تعليمات الاستيراد لا يتم تحميلها بالتوازي.",
            "scss.lint.important.desc": "تجنب استخدام `!important`. إنها تشير إلى أن خصوصية CSS بالكامل خرجت عن السيطرة ويجب إعادة هيكلتها.",
            "scss.lint.propertyIgnoredDueToDisplay.desc": "تم تجاهل الخاصية بسبب العرض. على سبيل المثال، مع \"display: inline\"، الخصائص مثل \"width\" و \"height\" و \"margin-top\" و \"margin-bottom\" و \"float\" لا تؤثر.",
            "scss.lint.universalSelector.desc": "من المعروف أن المحدد العام (\"*\") بطيء.",
            "scss.lint.unknownAtRules.desc": "قاعدة at-rule غير معروفة.",
            "scss.lint.unknownProperties.desc": "خاصية غير معروفة.",
            "scss.lint.unknownVendorSpecificProperties.desc": "خاصية محددة للبائع غير معروفة.",
            "scss.lint.validProperties.desc": "قائمة الخصائص التي لا يتم التحقق منها باستخدام قاعدة \"unknownProperties\".",
            "scss.lint.vendorPrefix.desc": "عند استخدام بادئة المورد، تأكد من تضمين الخاصية القياسية أيضًا.",
            "scss.lint.zeroUnits.desc": "لا حاجة لوحدة عند استخدام الصفر.",
            "scss.title": "SCSS (Sass)",
            "scss.validate.desc": "تفعيل أو تعطيل جميع التحقق من الصحة.",
            "scss.validate.title": "التحكم في التحقق من صحة SCSS ودرجة خطورة المشكلات."
        }
    }
}