{
    "": [
        "--------------------------------------------------------------------------------------------",
        "حقوق الطبع والنشر (c) Microsoft Corporation. جميع الحقوق محفوظة.",
        "مرخص بموجب رخصة MIT. راجع ملف License.txt في جذر المشروع لمعلومات الرخصة.",
        "--------------------------------------------------------------------------------------------",
        "لا تقم بتحرير هذا الملف. هو مولد آلي."
    ],
    "version": "1.0.0",
    "contents": {
        "bundle": {
            "Example": "مثال",
            "Files by Extension": "الملفات حسب الامتداد",
            "Files with Extension": "الملفات مع الامتداد",
            "Files with Multiple Extensions": "الملفات مع امتدادات متعددة",
            "Files with Path": "الملفات مع مسار الوصول",
            "Files with Siblings by Name": "الملفات مع عناصر في نفس المستوى حسب الاسم",
            "Folder by Name (Any Location)": "المجلد حسب الاسم (أي موقع)",
            "Folder by Name (Top Level)": "المجلد حسب الاسم (المستوى العلوي)",
            "Folders with Multiple Names (Top Level)": "المجلدات مع أسماء متعددة (المستوى العلوي)",
            "GitHub": "GitHub",
            "Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "تعيين جميع الملفات التي يتطابق مسارها مع نمط المسار المطلق إلى اللغة ذات المعرف المحدد.",
            "Map all files matching the glob pattern in their filename to the language with the given identifier.": "تعيين جميع الملفات التي يتطابق اسمها مع النمط العام إلى اللغة ذات المعرف المحدد.",
            "Match a folder with a specific name in any location.": "مطابقة مجلد باسم محدد في أي موقع.",
            "Match a top level folder with a specific name.": "مطابقة مجلد من المستوى العلوي باسم محدد.",
            "Match all files of a specific file extension.": "مطابقة جميع الملفات التي تحتوي على امتداد ملف محدد.",
            "Match all files with any of the file extensions.": "مطابقة جميع الملفات مع أي من امتدادات الملفات.",
            "Match files that have siblings with the same name but a different extension.": "مطابقة الملفات التي تحتوي على عناصر في نفس المستوى بنفس الاسم ولكن مع امتداد مختلف.",
            "Match multiple top level folders.": "مطابقة عدة مجلدات من المستوى العلوي.",
            "The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "الحرف الذي يستخدمه نظام التشغيل لفصل المكونات في مسارات الملفات. ويُعرف أيضًا بالرمز '/'.",
            "The current opened file": "الملف المفتوح الحالي",
            "The current opened file relative to ${workspaceFolder}": "الملف المفتوح الحالي بالنسبة إلى ${workspaceFolder}",
            "The current opened file workspace folder name without any slashes (/)": "اسم مجلد مساحة العمل للملف المفتوح حاليًا بدون أي شرطات مائلة (/)",
            "The current opened file's basename": "الاسم الأساسي للملف المفتوح حاليًا",
            "The current opened file's basename with no file extension": "الاسم الأساسي للملف المفتوح حاليًا بدون امتداد الملف",
            "The current opened file's dirname": "اسم دليل الملف المفتوح حاليًا",
            "The current opened file's dirname relative to ${workspaceFolder}": "اسم دليل الملف المفتوح حاليًا بالنسبة إلى ${workspaceFolder}",
            "The current opened file's extension": "امتداد الملف المفتوح حاليًا",
            "The current selected line number in the active file": "رقم السطر المحدد حاليًا في الملف النشط",
            "The current selected text in the active file": "النص المحدد حاليًا في الملف النشط",
            "The file extension of the editor (e.g. txt)": "امتداد الملف في المحرر (مثل txt)",
            "The file name of the editor without its directory or extension (e.g. myFile)": "اسم الملف في المحرر بدون دليله أو امتداده (مثل myFile)",
            "The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "اسم مهمة البناء الافتراضية. إذا لم تكن هناك مهمة بناء افتراضية واحدة، فسيتم عرض اختيار سريع لاختيار مهمة البناء.",
            "The name of the folder opened in VS Code without any slashes (/)": "اسم المجلد المفتوح في VS Code بدون أي شرطات مائلة (/)",
            "The nth parent folder name of the editor": "اسم المجلد الأب n للمحرر",
            "The parent folder name of the editor (e.g. myFileFolder)": "اسم المجلد الأب للمحرر (مثل myFileFolder)",
            "The path of the folder opened in VS Code": "مسار المجلد المفتوح في VS Code",
            "The path where an extension is installed.": "المسار الذي يتم فيه تثبيت الإضافة.",
            "The task runner's current working directory on startup": "دليل العمل الحالي لمشغل المهام عند بدء التشغيل",
            "Use the language of the currently active text editor if any": "استخدم لغة محرر النصوص النشط حاليًا إن وجد",
            "a conditional separator (' - ') that only shows when surrounded by variables with values": "فاصل شرطي (' - ') يظهر فقط عندما يكون محاطًا بالمتغيرات التي تحتوي على قيم",
            "an indicator for when the active editor has unsaved changes": "مؤشر لوقت وجود تغييرات غير محفوظة في المحرر النشط",
            "e.g. SSH": "مثلًا، SSH",
            "e.g. VS Code": "مثلًا، VS Code",
            "file path of the workspace (e.g. /Users/Development/myWorkspace)": "مسار الملف لمساحة العمل (مثلًا /Users/Development/myWorkspace)",
            "file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "مسار الملف لمجلد مساحة العمل الذي يحتوي على الملف (مثلًا /Users/Development/myFolder)",
            "gist": "ملخص",
            "name of the workspace folder the file is contained in (e.g. myFolder)": "اسم مجلد مساحة العمل الذي يحتوي على الملف (مثلًا myFolder)",
            "name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "اسم مساحة العمل مع اسم عن بعد اختياري ومؤشر مساحة العمل إذا كان ذلك ينطبق (مثلًا myFolder، myRemoteFolder [SSH] أو myWorkspace (Workspace))",
            "shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "الاسم المختصر لمساحة العمل بدون اللواحق (مثلًا myFolder أو myWorkspace)",
            "the file name (e.g. myFile.txt)": "اسم الملف (مثلًا myFile.txt)",
            "the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "المسار الكامل للملف (مثلًا /Users/Development/myFolder/myFileFolder/myFile.txt)",
            "the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "المسار الكامل للمجلد الذي يحتوي على الملف (مثلًا /Users/Development/myFolder/myFileFolder)",
            "the name of the active branch in the active repository (e.g. main)": "اسم الفرع النشط في المستودع النشط (مثلًا main)",
            "the name of the active repository (e.g. vscode)": "اسم المستودع النشط (مثلًا vscode)",
            "the name of the folder the file is contained in (e.g. myFileFolder)": "اسم المجلد الذي يحتوي على الملف (مثلًا myFileFolder)",
            "the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "مسار الملف بالنسبة لمجلد مساحة العمل (مثلًا myFolder/myFileFolder/myFile.txt)",
            "the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "مسار المجلد الذي يحتوي على الملف بالنسبة لمجلد مساحة العمل (مثلًا myFolder/myFileFolder)",
            "the state of the active editor (e.g. modified).": "حالة المحرر النشط (مثلًا، تم تعديله)."
        },
        "package": {
            "description": "يوفر ميزات (IntelliSense المتقدم، التصحيح التلقائي) في ملفات الإعداد، مثل ملفات القيم، البدء، وتوصية الإضافات.",
            "displayName": "تحرير الإعدادات"
        }
    }
}
